{"name":"crypto-square","blurb":"Implement the classic method for composing secret messages called a square code.","description":"The input is first normalized: The spaces and punctuation are removed from the\nEnglish text and the message is downcased.\n\nThen, the normalized characters are broken into rows.\nThese rows can be regarded as forming a rectangle\nwhen printed with intervening newlines.\n\nFor example, the sentence\n\n\u003e If man was meant to stay on the ground god would have given us roots\n\nis 54 characters long.\n\nBroken into 8-character columns, it yields 7 rows.\n\nThose 7 rows produce this rectangle when printed one per line:\n\n```plain\nifmanwas\nmeanttos\ntayonthe\ngroundgo\ndwouldha\nvegivenu\nsroots\n```\n\nThe coded message is obtained by reading down the columns going left to right.\n\nFor example, the message above is coded as:\n\n```plain\nimtgd vsfea rwerm ayoog\noanou uiont nnlvt wttdd\nesaoh ghnss eoau\n```\n\nWrite a program that, given an English text, outputs the encoded version of\nthat text.\n\nThe size of the square (number of columns) should be decided by the length of the message.\n\nIf the message is a length that creates a perfect square (e.g. 4, 9, 16, 25,\n36, etc), use that number of columns.\n\nIf the message doesn't fit neatly into a square, choose the number of columns\nthat corresponds to the smallest square that is larger than the number of\ncharacters in the message.\n\nFor example, a message 4 characters long should use a 2 x 2 square. A message\nthat is 81 characters long would use a square that is 9 colums wide.\n\nA message between 5 and 8 characters long should use a rectangle 3 characters wide.\n\nOutput the encoded text in groups of five letters.\n\nFor example:\n\n- \"Have a nice day. Feed the dog & chill out!\"\n  - Normalizes to: \"haveanicedayfeedthedogchillout\"\n  - Which has length: 36\n  - And splits into 5 6-character rows:\n    - \"havean\"\n    - \"iceday\"\n    - \"feedth\"\n    - \"edogch\"\n    - \"illout\"\n  - Which yields a ciphertext beginning: \"hifei acedl v…\"\n","source":"J Dalbey's Programming Practice problems","source_url":"http://users.csc.calpoly.edu/~jdalbey/103/Projects/ProgrammingPractice.html","expectations":[]}