{"name":"hamming","blurb":"Write a program that can calculate the Hamming distance between two DNA strands.","description":"A mutation is simply a mistake that occurs during the creation or copying of a nucleic acid, in particular DNA. Because nucleic acids are vital to cellular functions, mutations tend to cause a ripple effect throughout the cell. Although mutations are technically mistakes, a very rare mutation may equip the cell with a beneficial attribute. In fact, the macro effects of evolution are attributable by the accumulated result of beneficial microscopic mutations over many generations.\n\nThe simplest and most common type of nucleic acid mutation is a point mutation, which replaces one base with another at a single nucleotide.\n\nBy counting the number of differences between two homologous DNA strands taken from different genomes with a common ancestor, we get a measure of the minimum number of point mutations that could have occurred on the evolutionary path between the two strands.\n\nThis is called the 'Hamming distance'\n\n    GAGCCTACTAACGGGAT\n    CATCGTAATGACGGCCT\n    ^ ^ ^  ^ ^    ^^\n","source":"The Calculating Point Mutations problem at Rosalind","source_url":"http://rosalind.info/problems/hamm/","expectations":[{"name":"no difference between empty strands","input":{"strand1":"","strand2":""},"output":0},{"name":"no difference between identical strands","input":{"strand1":"GGACTGA","strand2":"GGACTGA"},"output":0},{"name":"complete hamming distance in small strand","input":{"strand1":"ACT","strand2":"GGA"},"output":3},{"name":"hamming distance in off by one strand","input":{"strand1":"GGACGGATTCTG","strand2":"AGGACGGATTCT"},"output":9},{"name":"small hamming distance in middle somewhere","input":{"strand1":"GGACG","strand2":"GGTCG"},"output":1},{"name":"larger distance","input":{"strand1":"ACCAGGG","strand2":"ACTATGG"},"output":2},{"name":"ignores extra length on other strand when longer","input":{"strand1":"AAACTAGGGG","strand2":"AGGCTAGCGGTAGGAC"},"output":3},{"name":"ignores extra length on original strand when longer","input":{"strand1":"GACTACGGACAGGGTAGGGAAT","strand2":"GACATCGCACACC"},"output":5}]}